using UnityEngine;

public class SimpleSpawner : MonoBehaviour
{
    //Выбирает точки для спавна:
    /*
    1. В области (или областях, или еще как-то)
    2. С максимальным количеством
    3. С промежутками
    4. Возможно связан с другими спавнерами (или возможность включать/выключать спавнер)
    5. Отдает команду (пока что в генератор почвы) (в какую точку спавнить)

    Будут другие спавнеры. Может базовый класс спавнеров сделать или фабричный метод? или какой-то паттерн?
     */

    //Лист коллайдеров? Или областей?

    //Функция просчета точки?

    //Отправление куда надо (менеджер или еще что-то), мб выбор тоже этот сделать через параметр
}
